/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50142
Source Host           : localhost:3306
Source Database       : ems

Target Server Type    : MYSQL
Target Server Version : 50142
File Encoding         : 65001

Date: 2016-06-07 18:24:34
*/

SET FOREIGN_KEY_CHECKS=0;
-- ----------------------------
-- Table structure for `complain_table`
-- ----------------------------
DROP TABLE IF EXISTS `complain_table`;
CREATE TABLE `complain_table` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `jobType` varchar(255) DEFAULT NULL,
  `acceptTime` datetime DEFAULT NULL,
  `timeOut` datetime DEFAULT NULL,
  `userName` varchar(255) DEFAULT NULL,
  `complainPhone` varchar(255) DEFAULT NULL,
  `contactPhone` varchar(255) DEFAULT NULL,
  `describe` varchar(255) DEFAULT NULL,
  `faultSite` varchar(255) DEFAULT NULL,
  `district` varchar(255) DEFAULT NULL,
  `community` varchar(255) DEFAULT NULL,
  `worker` varchar(255) DEFAULT NULL,
  `faultType` varchar(255) DEFAULT NULL,
  `faultCause` varchar(255) DEFAULT NULL,
  `disposeStatus` varchar(255) DEFAULT NULL,
  `untreatedCause` varchar(255) DEFAULT NULL,
  `feedbackTime` datetime DEFAULT NULL,
  `finishTime` datetime DEFAULT NULL,
  `handleTime` varchar(255) DEFAULT NULL,
  `overTimeCause` varchar(255) DEFAULT NULL,
  `rejectTime` datetime DEFAULT NULL,
  `rejectFinishTime` datetime DEFAULT NULL,
  `facility` varchar(255) DEFAULT NULL,
  `port` varchar(255) DEFAULT NULL,
  `complainCause` varchar(255) DEFAULT NULL,
  `remark` varchar(1000) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=226 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of complain_table
-- ----------------------------
INSERT INTO complain_table VALUES ('198', '7210086', '2016-05-04 20:49:00', '2016-06-05 02:49:16', '', '15297741180', '15297741180', '无法上网', '南康市赣州南康市路福服装城(FTTH)1号箱(南康市路福服装城斜对面);', '塔凹', '', '邱国建', '用户原因', '经检测，用户端路由器设置有误，经重新设置后网络恢复正常，用户认可', '', '', '1900-01-01 00:00:00', '2016-06-06 08:16:00', '35.44555555447005', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('199', '7210086', '2016-05-05 11:35:00', '2016-06-05 17:35:50', '', '15179050599', '15179050599', '无法上网', '南康市东山南路', '河边街', '', '陈松', '用户原因', '经检测，用户端路由器设置有误，经重新设置后网络恢复正常，用户认可', '', '', '2016-06-05 19:22:00', '2016-06-06 08:16:00', '20.66944444330875', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('200', '7210086', '2016-05-05 17:05:00', '2016-06-05 23:05:56', '', '13763921009', '13763921009', '无法上网', '南康市赣州南康市蓉江镇岭背55号FTTB(蓉江街道岭背七组);', '停车场', '', '张梦鑫', '其他', '经检测，用户操作不当导致，已修复', '', '', '2016-06-05 20:42:00', '2016-06-06 08:16:00', '15.167777776834555', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('201', '7210086', '2016-05-05 19:55:00', '2016-06-06 01:55:20', '', '13870756132', '13870756132', 'HITV故障', '南康市通站大道通站花园A2栋();', '家具城', '', '赖健华', '用户终端故障', '经检测，用户端路由器死机导致，重启后恢复', '', '', '2016-06-05 20:45:00', '2016-06-06 08:16:00', '12.344444443238899', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('202', '7210086', '2016-05-05 19:32:00', '2016-06-06 01:32:14', '', '13970130945', '13970130945', '无法上网', '南康市蓉江东路夜市街小区三华照相馆后1单元();', '停车场', '', '张梦鑫', '用户终端故障', '经检测，用户端路由器设置有误，经重新设置后网络恢复正常，用户认可', '', '', '2016-06-05 20:49:00', '2016-06-06 08:16:00', '12.729444444004912', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('203', '7210086', '2016-05-05 20:30:00', '2016-06-06 02:30:32', '', '13870709001', '13870709001', 'HITV故障', '南康市赣州南康市蓉江镇东门北路东门北路社会停车场1301号9#箱F(131号（至通汽贸楼上）);', '停车场', '', '张梦鑫', '用户终端故障', '经检测，用户端机顶盒死机，重启后恢复', '', '', '2016-06-05 21:15:00', '2016-06-06 08:16:00', '11.757777777733281', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('204', '7210086', '2016-05-04 17:03:00', '2016-06-04 23:03:36', '', '13870707335', '13870707335', '无法上网', '南康市赣州南康市金鸡镇金鸡镇工业二路安置点3号箱FTTB();', '家具城', '', '陈华阳', '线路故障', '经检测，用户室内线水晶头松动，经重新制作水晶头后网络恢复正常，用户认可。', '', '', '2016-06-06 08:16:00', '2016-06-06 08:16:00', '39.206666666432284', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('205', '7210086', '2016-05-05 15:42:00', '2016-06-05 21:42:05', '', '15070722253', '15070722253', '无法上网', '南康市迎宾大道迎宾花园小区();', '家具城', '', '陈华阳', '自行恢复', '经联系用户，用户端网络自行恢复正常，无需上门，用户认可，烦请核实！！！', '', '', '2016-06-06 08:18:00', '2016-06-06 08:18:00', '16.598611111112405', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('206', '10086', '2016-05-03 16:33:00', '2016-06-03 20:33:47', '朱传群', '18770709959', '18770709959', '无覆盖不满', '南康市赣州南康市坪岭安置点文峰大道旁18号箱FTTB();', '家具城', '', '刘申康', '其他', '退费处理', '', '压单4号', '1900-01-01 00:00:00', '2016-06-04 08:51:00', '16.286944444756955', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('207', '10086', '2016-05-03 20:26:00', '2016-06-04 00:26:29', '肖建华', '13479763693', '13479763693', '断线', '南康市赣州南康市金鸡镇迎宾东大道金鸡路211号2#();', '河边街', '', '陈松', '设备类故障', '经检测，箱体设备数据问题，已维护后网络恢复正常，用户认可', '', '', '1900-01-01 00:00:00', '2016-06-04 08:52:00', '12.425277777481824', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('208', '10086', '2016-05-05 08:08:00', '2016-06-05 12:08:04', '陈贻汎', '18370440766', '15107081161', '无法上网', '南康市赣州南康市唐江镇唐江章石村2号箱();', '乡镇', '', '林国院', '自行恢复', '经联系用户，用户端网络自行恢复正常，无需上门，用户认可，烦请核实！！！', '', '压单6号，用户无时间', '1900-01-01 00:00:00', '2016-06-05 18:18:00', '10.165555555082392', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('209', '10086', '2016-05-05 09:54:00', '2016-06-06 13:54:42', '廖国建', '18770726106', '18770726106', '无法上网', '南康市赣州南康市蓉江镇蓉江镇旭山北路朱屹里4号箱FTTB();', '停车场', '', '张梦鑫', '自行恢复', '经联系用户，用户端网络自行恢复正常，无需上门，用户认可，烦请核实！！！', '', '', '1900-01-01 00:00:00', '2016-06-06 13:07:00', '3.2050000007729977', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('210', '7210086', '2016-06-04 11:54:11', '2016-06-04 17:54:11', '', '15727742776', '15279785052', '无法上网', '南康市赣州南康市金鸡镇工业大道附近(FTTH)08#();', '家具城', '', '赖健华', '光缆故障', '经检测，光纤衰耗过大，经抢修后网络恢复正常，用户认可', '', '', '2016-06-05 09:31:00', '2016-06-06 08:18:00', '44.396944444743', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('211', '7210086', '2016-06-05 10:30:27', '2016-06-05 16:30:27', '', '18870763909', '15070777535', '无法上网', '南康市赣州南康市家具城床具中心8(FTTH)(A1);', '家具城', '', '赖健华', '光缆故障', '经检测，光纤衰耗过大，经抢修后网络恢复正常，用户认可', '', '', '2016-06-05 18:57:00', '2016-06-06 08:18:00', '21.7924999991083', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('212', '7210086', '2016-06-04 21:59:32', '2016-06-05 03:59:32', '', '13763975867', '13763975867', '无法上网', '宏景苑后面;', '塔凹', '', '刘建平', '自行恢复', '经联系用户，用户端网络自行恢复正常，无需上门，用户认可，烦请核实！！！', '', '', '2016-06-04 20:06:00', '2016-06-06 08:18:00', '34.3077777766739', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('213', '7210086', '2016-06-05 19:36:15', '2016-06-06 01:36:15', '', '15970960323', '15179736582', 'HITV故障', '南康市东门北路社会停车场小区社会停车场后门对面(五零三楼上);', '停车场', '', '张梦鑫', '设备类故障', '经检测，用户机顶盒问题，经更换后恢复正常，用户认可。HITV故障，请派往自有业务--互联网电视--使用类，非宽带故障投诉。请省客服核实并更改投诉类型，谢谢！', '', '', '2016-06-05 21:39:00', '2016-06-06 08:18:00', '12.6958333318471', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('214', '7210086', '2016-06-06 08:20:03', '2016-06-06 14:20:03', '', '13870751089', '13870751089', '678', '南康市赣州南康市蓉江镇泰康西路华盛苑A栋FTTB();', '西门坝', '', '赖强', '自行恢复', '经联系用户，用户端网络自行恢复正常，无需上门，用户认可，烦请核实！！！', '', '', '2016-06-06 11:02:00', '2016-06-07 08:18:00', '23.9658333335537', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('215', '7210086', '2016-06-05 18:25:37', '2016-06-06 00:25:37', '', '18370769092', '18370769092', '无法上网', '南康市赣州南康市泓泰家具城A区A1栋1楼FTTB1单元1层101();', '家具城', '', '林毓宗', '电源故障', '经检测，设备空开烧坏，经更换空开后网络恢复正常，用户认可。', '', '', '2016-06-06 11:05:00', '2016-06-06 08:18:00', '13.8730555559741', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('216', '7210086', '2016-06-06 09:09:07', '2016-06-06 15:09:07', '', '15970141405', '15970141405', '无法上网', '南康市金鸡镇金鸡镇泓泰家具城A区会展1栋', '家具城', '', '林毓宗', '用户终端故障', '经检测，用户端路由器设置有误，经重新设置后网络恢复正常，用户认可', '', '', '1900-01-01 00:00:00', '2016-06-06 11:45:00', '2.59805555606727', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('217', '7210086', '2016-06-04 10:17:19', '2016-06-04 16:17:19', '', '18720716232', '18720716232', '无法上网', '南康市赣州南康市金鸡镇南水大道南水大道南水巴黎大厦面第四排();', '南水', '', '陈建国', '线路故障', '经检测，用户端室外线被剪断，经重新拉线后网络恢复正常，用户认可。', '', '预约下午', '2016-06-05 11:38:00', '2016-06-06 11:49:00', '49.5280555561767', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('218', '7210086', '2016-06-04 18:36:33', '2016-06-05 00:36:33', '', '18214999794', '18214999794', '无法上网', '南康市赣州南康市河边街金山路贝贝幼儿园斜对面5号箱();', '河边街', '', '吴鑫旺', '自行恢复', '经联系用户，用户端网络自行恢复正常，无需上门，用户认可，烦请核实！！！', '', '不接电话', '2016-06-05 10:57:00', '2016-06-06 11:50:00', '41.2241666677874', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('219', '7210086', '2016-06-05 09:04:38', '2016-06-05 15:04:38', '', '13607970608', '13607970608', '无法上网', '南康市唐江镇十里街2十里街幼儿园对面();', '乡镇', '', '林国院', '自行恢复', '经联系用户，用户端网络自行恢复正常，无需上门，用户认可，烦请核实！！！', '', '设备没电', '2016-06-05 10:45:00', '2016-06-06 11:52:00', '26.789444444119', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('220', '7210086', '2016-06-06 09:46:17', '2016-06-06 15:46:17', '', '15216191228', '15216191228', '无法上网', '南康市阳光里', '南水', '', '陈建国', '用户终端故障', '经检测，用户端路由器设置有误，经重新设置后网络恢复正常，用户认可', '', '', '1900-01-01 00:00:00', '2016-06-06 12:05:00', '2.31194444443099', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('221', '10086', '2016-06-06 10:52:50', '2016-06-06 14:52:50', '叶挺高', '13607970608', '13607970608', '无法上网', '南康市唐江镇十里街2十里街幼儿园对面();', '乡镇', '', '林国院', '电源故障', '经检测，因未交电费，物业停电导致设备没电，经与物业协商后网络恢复正常，用户认可。', '', '', '1900-01-01 00:00:00', '2016-06-06 15:11:00', '4.302777777600568', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('222', '10086', '2016-06-06 11:48:12', '2016-06-06 15:48:12', '肖观音', '18370805139', '13627070845', '无法上网', '南康市赣州南康市金鸡镇工业大道坪岭安置点文峰酒店FTTB();', '家具城', '', '刘申康', '用户终端故障', '经核实，用户端路由器故障，网络正常，已跟用户解释，用户认可', '', '', '1900-01-01 00:00:00', '2016-06-06 15:54:00', '4.096666665631346', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('223', '10086', '2016-06-06 09:14:37', '2016-06-06 13:14:37', '张厚平', '13879707468', '13879707468', '678', '南康市赣州南康市坪市乡信用社3号箱FTTB();', '乡镇', '', '坪市-明邦良', '用户终端故障', '经核实，用户端路由器故障，网络正常，用户认可', '', '', '1900-01-01 00:00:00', '2016-06-06 16:30:00', '7.256388887995854', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('224', '10086', '2016-06-06 10:11:31', '2016-06-06 14:11:31', '刘传宝', '15083928850', '15083928850', '无法上网', '南康市赣州南康市龙岭镇G105国道街道两边（FTTH）30号箱();', '乡镇', '', '钟健', '线路故障', '经检测，用户端室外线被剪断，经重新拉线后网络恢复正常，用户认可。', '', '压单8号', '2016-06-06 16:31:00', '2016-06-06 16:51:00', '6.658055556064937', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
INSERT INTO complain_table VALUES ('225', '7210086', '2016-07-04 11:54:11', '2016-07-04 17:54:11', '', '15727742776', '15279785052', '无法上网', '南康市赣州南康市金鸡镇工业大道附近(FTTH)08#();', '家具城', '', '赖健华', '光缆故障', '经检测，光纤衰耗过大，经抢修后网络恢复正常，用户认可', '', '', '2016-07-05 09:31:00', '2016-07-06 08:18:00', '44.396944444743', '', '1900-01-01 00:00:00', '1900-01-01 00:00:00', '', '', '', '');
